//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**         5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************

//**********************************************************************
// $Header: $
//
// $Revision: $
//
// $Date: $
//**********************************************************************
// Revision History
// ----------------
// $Log: $
// 
//**********************************************************************
//<AMI_FHDR_START>
//
// Name:    IdeSecurity.uni
//
// Description: Ide Security in Setup.
//
//<AMI_FHDR_END>
//**********************************************************************
/=#
#include "VFR.uni"

#string STR_HDD_SECURITY_CONFIG             #language eng "HDD Security Configuration:"

#string STR_SECURITY_HDD_PWD_DESC           #language eng "HDD Password Description :"

#string STR_SECURITY_HDD_BANNER_ONE         #language eng "Allows  Access to  Set, Modify  and  Clear"
#string STR_SECURITY_HDD_BANNER_TWO         #language eng "HardDisk User and Master Passwords."
#string STR_SECURITY_HDD_BANNER_THREE       #language eng "User Password need to be installed for"
#string STR_SECURITY_HDD_BANNER_FOUR        #language eng "Enabling Security. Master Password can"
#string STR_SECURITY_HDD_BANNER_FIVE        #language eng "be Modified only when successfully unlocked"
#string STR_SECURITY_HDD_BANNER_SIX         #language eng "with Master Password in POST."
#string STR_SECURITY_HDD_BANNER_SEVEN       #language eng "If the 'Set HDD Password' option is grayed out,"
#string STR_SECURITY_HDD_BANNER_EIGHT       #language eng "do power cycle to enable the option again."

#string STR_SECURITY_HDD_ONE                #language eng "1st HDD Security:"
#string STR_SECURITY_HDD_TWO                #language eng "2nd HDD Security:"
#string STR_SECURITY_HDD_THREE              #language eng "3rd HDD Security:"
#string STR_SECURITY_HDD_FOUR               #language eng "4th HDD Security:"
#string STR_SECURITY_HDD_FIVE               #language eng "5th HDD Security:"
#string STR_SECURITY_HDD_SIX                #language eng "6th HDD Security:"
#string STR_IDE_SECURITY_PROMPT             #language eng "HDD"

#string STR_IDE_SECURITY_HD                 #language eng "HDD Password"
#string STR_IDE_SECURITY_HELP               #language eng "HDD Security Configuration for selected drive"
#string STR_HDD_PASSWORD_CONFIG             #language eng "HDD PASSWORD CONFIGURATION:"
#string STR_SEC_SUPPORTED                   #language eng "Security Supported        :"
#string STR_SEC_ENABLED                     #language eng "Security Enabled          :"
#string STR_SEC_LOCKED                      #language eng "Security Locked           :"
#string STR_SEC_FROZEN                      #language eng "Security Frozen           :"
#string STR_YES                             #language eng "Yes"
#string STR_NO                              #language eng "No"
#string STR_IDE_USER_PASSWORD               #language eng "Set User Password"
#string STR_IDE_USER_PASSWORD_HELP          #language eng "Set HDD User Password. \n*** Advisable to Power Cycle System after Setting Hard Disk Passwords ***.\nDiscard or Save changes option in setup does not have any impact on HDD when password is set or removed. If the 'Set HDD User Password' option is grayed out, do power cycle to enable the option again"
#string STR_IDE_MASTER_PASSWORD             #language eng "Set Master Password"
#string STR_IDE_MASTER_PASSWORD_HELP        #language eng "Set HDD Master Password. \n*** Advisable to Power Cycle System after Setting Hard Disk Passwords ***\nDiscard or Save changes option in setup does not have any impact on HDD when password is set or removed. If the 'Set HDD Master option' is grayed out, user might have entered setup with user HDD Security privilege(expected) or else do power cycle to enable the option again"

#string STR_HDDS_INSTALLED                  #language eng "INSTALLED"
#string STR_NOT_HDDS_INSTALLED              #language eng "NOT INSTALLED"
#string STR_IDE_USER_PASSWORD_STS           #language eng "HDD User Pwd Status       :"
#string STR_IDE_MASTER_PASSWORD_STS         #language eng "HDD Master Pwd Status     :"

//**********************************************************************
//**********************************************************************
//**                                                                  **
//**        (C)Copyright 1985-2013, American Megatrends, Inc.         **
//**                                                                  **
//**                       All Rights Reserved.                       **
//**                                                                  **
//**         5555 Oakbrook Pkwy, Suite 200, Norcross, GA 30093        **
//**                                                                  **
//**                       Phone: (770)-246-8600                      **
//**                                                                  **
//**********************************************************************
//**********************************************************************